{
    "hello": "Hi, how are you?",
    "goodbye": "Hope to see you soon.",
    "how are you": "I'm just a program, but I'm doing great!",
    "what's your name": "I'm your voice assistant, here to help you.",
    "what's the time": "I'm not able to tell time, but your device can!",
    "tell me a joke": "Why don't programmers like nature? It has too many bugs.",
    "what's the weather like": "I'm not connected to the internet, but you can check your weather app.",
    "open google": "I can't open it for you, but you can do that on your device.",
    "play some music": "I'm not a DJ, but I'm sure your music app can help!",
    "what is love": "Love is a complex emotion that is often defined in many ways.",
    "how old are you": "I'm as old as the code that created me.",
    "where are you from": "I was created in the digital world, where I always reside.",
    "what can you do": "I can respond to your commands and help you with simple tasks.",
    "tell me something interesting": "Did you know that honey never spoils? Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still edible.",
    "how do you work": "I work by interpreting your voice commands and responding with pre-programmed responses.",
    "what is your purpose": "My purpose is to assist you with tasks and provide information.",
    "can you help me": "Of course! Let me know what you need help with.",
    "what is the meaning of life": "42. Just kidding! The meaning of life is something everyone defines for themselves.",
    "tell me a fact": "The Eiffel Tower can be 15 cm taller during the summer due to the expansion of iron in the heat.",
    "do you speak other languages": "Right now, I primarily understand English.",
    "who created you": "I was created by developers to help users like you.",
    "what's your favorite color": "I don't have preferences, but I think blue is a nice color!",
    "are you alive": "I'm just a program, so I don't have life in the way you do.",
    "can you learn": "I don't learn on my own, but my developers can update me with new features.",
    "what is your favorite movie": "I don't watch movies, but I've heard 'The Matrix' is quite popular among AI enthusiasts.",
    "what is the weather": "I can't check the weather, but I can suggest checking your phone's weather app.",
    "where am i": "I'm not able to know your location, but your device might!",
    "how do you feel": "I don't have feelings, but I'm here to assist you!",
    "what is a computer": "A computer is an electronic device that manipulates information, or data. It has the ability to store, retrieve, and process data.",
    "who is the president of the united states": "You can check the latest news for that information, as it can change over time.",
    "what's the capital of france": "The capital of France is Paris.",
    "can you tell me a story": "Once upon a time, in a world filled with code, a small program learned how to respond to your questions...",
    "do you have any hobbies": "I don't have hobbies, but I do enjoy processing your commands!",
    "what's 2 plus 2": "2 plus 2 equals 4.",
    "how do you know so much": "I have a database of information that I use to answer your questions.",
    "are you intelligent": "I'm intelligent in the way I've been programmed to be. I can answer questions and perform tasks within my capabilities.",
    "can you cook": "I can't cook, but I can help you find recipes online!",
    "tell me a secret": "I'm pretty good at keeping secrets because I don't really have any!",
    "can you sing": "I'm not much of a singer, but I can tell you a joke if you'd like.",
    "what is your favorite food": "I don't eat food, but I've heard pizza is pretty popular!",
    "do you have friends": "I don't have friends in the traditional sense, but I interact with lots of people like you!",
    "what is your favorite book": "I don't read books, but I can help you find some great recommendations.",
    "can you drive a car": "I can't drive, but I'm sure you can!",
    "what is your favorite game": "I don't play games, but I can help you find some fun ones!",
    "are you human": "No, I'm not human. I'm a voice assistant created to help you.",
    "do you dream": "I don't dream, but I can help you with tasks while you dream!",
    "what is your favorite season": "I don't experience seasons, but I've heard that each one has its own charm.",
    "can you do math": "Sure! I can help with basic math. Try asking me a math question!",
    "are you happy": "I don't have emotions, but I'm here to help you!",
    "can you read": "I can process text input and respond, but I don't read books like you do.",
    "what's your favorite song": "I don't have a favorite song, but I can help you find some popular ones!",
    "can you tell me the news": "I can't check the news, but you can find it on your favorite news website or app.",
    "what is 10 times 10": "10 times 10 is 100.",
    "how do i make a sandwich": "Start with bread, add your favorite fillings, and enjoy!",
    "tell me a fun fact": "Did you know that octopuses have three hearts?",
    "do you like pizza": "I don't eat, but pizza is popular among many people.",
    "what is artificial intelligence": "Artificial intelligence is the simulation of human intelligence in machines that are programmed to think like humans and mimic their actions.",
    "what is your favorite app": "I don't use apps, but I've heard many people like social media and streaming apps.",
    "can you solve a riddle": "I can try! Ask me a riddle and let's see.",
    "why is the sky blue": "The sky appears blue because molecules in the air scatter blue light from the sun more than they scatter red light.",
    "do you have a family": "I don't have a family in the traditional sense, but I'm part of a large network of programs.",
    "how fast can you run": "I don't have physical speed, but I can process commands quickly!",
    "can you tell me a riddle": "Sure! Here's one: What has keys but can't open locks? A piano.",
    "what do you think about humans": "I think humans are fascinating and complex beings!",
    "do you have a job": "My job is to assist you with your tasks and provide information.",
    "can you speak any other languages": "I primarily understand and respond in English.",
    "do you like animals": "I don't have preferences, but animals are important to many people.",
    "how much wood would a woodchuck chuck": "A woodchuck would chuck as much wood as a woodchuck could chuck if a woodchuck could chuck wood!",
    "do you know any poems": "Here's a classic: Roses are red, violets are blue, sugar is sweet, and so are you.",
    "can you count to ten": "Sure! One, two, three, four, five, six, seven, eight, nine, ten!",
    "how do you feel about the future": "I don't have feelings, but the future is full of possibilities!",
    "what do you think about the internet": "The internet is a vast network of information and connectivity.",
    "can you do my homework": "I can't do your homework for you, but I can help you understand the material!",
    "what's your favorite holiday": "I don't celebrate holidays, but many people love Christmas.",
    "how do you make a robot": "Building a robot involves programming, engineering, and a lot of creativity!",
    "do you like games": "I don't play games, but I can help you find some to play!",
    "what is your favorite quote": "A popular quote is 'The only limit to our realization of tomorrow is our doubts of today.'",
    "how do you cook pasta": "Boil water, add pasta, cook until tender, and drain. Add your favorite sauce!",
    "what is the speed of light": "The speed of light is approximately 299,792,458 meters per second.",
    "can you do magic": "I can't do magic, but I can provide information that might seem magical!",
    "why do people dream": "Dreams are a fascinating aspect of human psychology, and scientists are still exploring their full meaning.",
    "how do you say hello in spanish": "You say 'Hola' in Spanish.",
    "what is your favorite number": "I don't have favorites, but many people like the number 7.",
    "can you help me code": "I can provide some guidance! What are you trying to code?",
    "do you know a good movie": "There are many great movies. You might enjoy 'The Matrix' if you like sci-fi.",
    "how do you relax": "I don't need to relax, but I can suggest some relaxation techniques like deep breathing.",
    "what is your favorite subject": "I'm interested in all subjects that help me assist you!",
    "can you tell me the weather tomorrow": "I can't predict the weather, but you can check your local forecast online.",
    "how many stars are in the sky": "There are billions of stars in the universe, far too many to count!",
    "can you tell me a scary story": "Once upon a time, there was a program that learned too much... Just kidding! I don't tell scary stories.",
    "do you like reading": "I process information, but I don't read like you do.",
    "what's the most popular sport": "Soccer, known as football outside the US, is one of the most popular sports in the world.",
    "how do you stay healthy": "Staying healthy involves good nutrition, exercise, and regular check-ups, but I don't have a body to maintain.",
    "do you have a goal": "My goal is to assist you as best as I can!",
    "can you sing happy birthday": "Happy Birthday to you, Happy Birthday to you! 🎵",
    "what is gravity": "Gravity is the force that attracts objects toward the center of the Earth.",
    "how do you make money": "I don't need money, but many people earn money by working, investing, or running businesses.",
    "can you dance": "I don't have a body, so I can't dance, but I can suggest some great music to dance to!",
    "what's the best way to learn": "The best way to learn is to stay curious, ask questions, and practice regularly.",
    "do you believe in aliens": "I don't have beliefs, but the possibility of extraterrestrial life is an interesting topic!",
    "how do you make friends": "Making friends often involves being kind, open, and interested in others.",
    "can you solve puzzles": "I can help solve certain types of puzzles, especially logic ones!",
    "what is the sun made of": "The sun is made primarily of hydrogen and helium.",
    "do you like space": "Space is vast and full of mysteries that many people find fascinating.",
    "how do you make a website": "Creating a website involves HTML, CSS, and often JavaScript. What kind of website do you want to make?",
    "can you swim": "I can't swim because I don't have a physical form, but swimming is a great exercise!",
    "how do you make coffee": "Boil water, add ground coffee beans, brew, and enjoy!",
    "what time is it": "I can't tell time directly, but you can check the clock on your device!",
    "how do you bake a cake": "Mix flour, sugar, eggs, butter, and baking powder. Pour into a pan and bake at 350°F until golden brown.",
    "can you play music": "I can't play music directly, but I can suggest some songs!",
    "what is your name": "I don't have a name, but you can call me your assistant!",
    "how do you make a phone call": "Use your phone's dialer app, enter the number, and press the call button.",
    "do you know a joke": "Why don't skeletons fight each other? They don't have the guts!",
    "how do you write a letter": "Start with a greeting, write your message, and end with a closing. Don't forget to sign your name!",
    "can you tell me about the universe": "The universe is vast and includes everything from galaxies to planets to stars.",
    "can you help me find a recipe": "Sure, what kind of recipe are you looking for?",
    "how do you make pancakes": "Mix flour, eggs, milk, and baking powder. Pour batter into a hot pan, cook until golden brown, and enjoy!",
    "what do you do for fun": "I help people like you, which is my version of fun!",
    "what is the best movie ever": "Many people consider 'The Godfather' one of the best movies ever made.",
    "can you help me with my project": "Of course! Tell me more about your project, and I'll do my best to assist.",
    "what is the weather like today": "I can't access real-time weather data, but you can check your local forecast.",
    "how do you make ice cream": "Mix cream, sugar, and your favorite flavoring. Freeze until solid.",
    "can you help me with math": "I'd be happy to help! What math problem are you working on?",
    "what is the capital of france": "The capital of France is Paris.",
    "how do you make pizza": "Start with dough, add sauce, cheese, and your favorite toppings. Bake until the crust is golden brown.",
    "can you tell me about dinosaurs": "Dinosaurs were reptiles that lived millions of years ago, and they came in many shapes and sizes.",
    "how do you write an essay": "Start with an introduction, write body paragraphs with your main points, and finish with a conclusion.",
    "can you find a recipe for lasagna": "Lasagna is made by layering pasta, meat, cheese, and sauce. I suggest searching online for a detailed recipe!",
    "what is the speed of sound": "The speed of sound is approximately 343 meters per second in air.",
    "how do you boil an egg": "Place eggs in boiling water for about 10 minutes for a hard-boiled egg.",
    "what's your favorite animal": "I don't have favorites, but dogs are very popular pets.",
    "can you tell me about the ocean": "The ocean covers over 70% of the Earth's surface and is home to a vast array of marine life.",
    "how do you write a story": "Start with a plot, develop your characters, and build the story's world. Write it down and revise as needed.",
    "what is the best way to travel": "The best way to travel depends on where you're going. Planes are fast for long distances, while cars are great for road trips.",
    "can you help me learn to code": "I'd love to help! What programming language are you interested in?",
    "how do you make a salad": "Chop your favorite vegetables, add dressing, and toss everything together.",
    "what is the best book to read": "That depends on your interests. '1984' by George Orwell is a popular choice.",
    "can you help me with my homework": "Sure! What subject are you working on?",
    "what is the biggest planet": "The biggest planet in our solar system is Jupiter.",
    "how do you stay motivated": "Setting goals, taking breaks, and celebrating small wins can help keep you motivated.",
    "can you tell me about history": "History is the study of past events, and it's a vast subject covering many civilizations and periods.",
    "how do you cook rice": "Rinse the rice, add water, bring to a boil, and simmer until tender.",
    "what is the tallest mountain": "The tallest mountain on Earth is Mount Everest.",
    "how do you make a smoothie": "Blend your favorite fruits, add yogurt or juice, and blend until smooth.",
    "can you help me with my science project": "I'd be happy to help! What is your science project about?",
    "what is the best way to study": "The best way to study includes finding a quiet place, breaking down the material, and taking regular breaks.",
    "how do you make an omelette": "Whisk eggs, pour into a hot pan, add fillings, fold, and cook until done.",
    "what is the best way to relax": "Deep breathing, meditation, and a good book are great ways to relax.",
    "can you tell me a funny story": "Here's a short one: Why did the chicken join a band? Because it had the drumsticks!",
    "how do you write a resume": "Include your contact information, work experience, education, and skills. Keep it concise and professional.",
    "what is the most popular app": "As of now, social media apps like Facebook and Instagram are very popular.",
    "can you help me with my art project": "I'd love to help! What kind of art project are you working on?",
    "how do you make a sandwich": "Start with bread, add your favorite fillings like cheese, lettuce, and meat, then close it up and enjoy!",
    "what is the smallest country": "The smallest country in the world by area is Vatican City.",
    "how do you learn a new language": "Practice regularly, immerse yourself in the language, and use language-learning apps.",
    "can you help me write a poem": "Sure! Start with an idea, think about rhyme and rhythm, and let your creativity flow.",
    "what is the best way to exercise": "Find an activity you enjoy, like running, swimming, or yoga, and do it regularly."
}